export const EASY_FORMATIONS = [
  // 3-as vízszintes
  [
    { x: 0, y: 0 },
    { x: -180, y: 0 },
    { x: 180, y: 0 },
  ],
  // 3-as függőleges
  [
    { x: 0, y: 0 },
    { x: 0, y: -150 },
    { x: 0, y: 150 },
  ],
  // fordított V
  [
    { x: 0, y: 0 },
    { x: -70, y: 70 },
    { x: 70, y: 70 },
  ],
  // V alak
  [
    { x: 0, y: 0 },
    { x: -70, y: -70 },
    { x: 70, y: -70 },
  ]
];

export const FORMATIONS = [

  // Kereszt
  [
    { x: 0, y: 0 },
    { x: -170, y: 0 },
    { x: 170, y: 0 },
    { x: 0, y: -170 },
    { x: 0, y: 170 },
  ],

  // X alak
  [
    { x: 0, y: 0 },
    { x: -140, y: -140 },
    { x: 140, y: -140 },
    { x: -140, y: 140 },
    { x: 140, y: 140 },
  ],

  // V alak
  [
    { x: 0, y: 0 },
    { x: -70, y: -70 },
    { x: 70, y: -70 },
    { x: -140, y: -140 },
    { x: 140, y: -140 },
  ],

  // Fordított V
  [
    { x: 0, y: 0 },
    { x: -70, y: 70 },
    { x: 70, y: 70 },
    { x: -140, y: 140 },
    { x: 140, y: 140 },
  ],

  // Vízszintes vonal
  [
    { x: 0, y: 0 },
    { x: -150, y: 0 },
    { x: 150, y: 0 },
    { x: -300, y: 0 },
    { x: 300, y: 0 },
  ],

  // Függőleges vonal
  [
    { x: 0, y: 0 },
    { x: 0, y: -90 },
    { x: 0, y: 90 },
    { x: 0, y: -180 },
    { x: 0, y: 180 },
  ],

];